In [50]:
import pandas as pd
import numpy as np
labels=['a','b','c','d']
list = [1,2,3,4]
dict = {'a':100,'b':200,'c':300,'d':400}
series=pd.Series(list,index=labels)
print(series)
series2=pd.Series(dict)
series2

a    1
b    2
c    3
d    4
dtype: int64

a    100
b    200
c    300
d    400
dtype: int64

DataFrame Creation

In [51]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df1 = pd.DataFrame(data,index = ['a','b','c','d'])
print(df1)

    Name  Age      City  Salary
a   John   28  New York   65000
b   Anna   34     Paris   70000
c  Peter   29    Berlin   62000
d  Linda   42    London   85000

In [52]:
data = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data,columns=['a','b','c','d'])
print(df2)

       a   b         c      d
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [53]:
print(df2[['a', 'c']])

       a         c
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [54]:
df1["Job"]=["Doctor","Engineer","Scientist","Teacher"]

In [55]:
df1

    Name  Age      City  Salary        Job
a   John   28  New York   65000     Doctor
b   Anna   34     Paris   70000   Engineer
c  Peter   29    Berlin   62000  Scientist
d  Linda   42    London   85000    Teacher

In [56]:
# df1 = df1.drop("a",axis=0)
# df1

In [57]:
df1.loc["b"]

Name          Anna
Age             34
City         Paris
Salary       70000
Job       Engineer
Name: b, dtype: object

In [58]:
df1.loc[["a","b"]]

   Name  Age      City  Salary       Job
a  John   28  New York   65000    Doctor
b  Anna   34     Paris   70000  Engineer

In [59]:
df1.loc[["a","b"]][["Salary","Job"]]

   Salary       Job
a   65000    Doctor
b   70000  Engineer

In [60]:
df1

    Name  Age      City  Salary        Job
a   John   28  New York   65000     Doctor
b   Anna   34     Paris   70000   Engineer
c  Peter   29    Berlin   62000  Scientist
d  Linda   42    London   85000    Teacher

In [61]:
df1[df1["Age"] == 28]

   Name  Age      City  Salary     Job
a  John   28  New York   65000  Doctor

In [62]:
df1[df1["Age"] > 28]

    Name  Age    City  Salary        Job
b   Anna   34   Paris   70000   Engineer
c  Peter   29  Berlin   62000  Scientist
d  Linda   42  London   85000    Teacher

In [63]:
df1[(df1["Age"] > 28) & (df1["City"] == 'Paris')]

   Name  Age   City  Salary       Job
b  Anna   34  Paris   70000  Engineer

In [64]:
data1 = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df3 = pd.DataFrame(data1)
df3

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [65]:
df3.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [66]:
df3.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [67]:
df3.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

In [68]:
# df3.fillna(0,inplace = True)
# df3

In [71]:
df3.fillna(df3.mean(),inplace = True)
df3

     A    B    C    D
0  1.0  3.5  1.0  1.0
1  2.0  2.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  2.0  3.0
4  5.0  5.0  2.0  5.0

In [72]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [73]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [74]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [75]:
pd.merge(employees,salaries,on = "employee_id",how = "inner")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [76]:
pd.merge(employees,salaries,on = "employee_id",how = "outer")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [77]:
pd.merge(employees,salaries,on = "employee_id",how = "left")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [ ]:
pd.merge(employees,salaries,on = "employee_id",how = "right")